{
    "Home":"الرئيسية",
    "About Us":"معلومات عنا",
    "Services":"خدماتنا",
    "SERVICES":"خدمات",
    "Portfolio":"أعمالنا",
    "Contact Us":"اتصل بنا",
    
    "Najla Technologies Pvt. Ltd":"نائلة تكنولوجيز الجندي. المحدودة.",
    "Partnering for Progress, Leading for Success.":"الشراكة من أجل التقدم، والقيادة من أجل النجاح.",

    "Unlock the full potential of your business with cutting-edge software solutions designed to drive growth and innovation. By turning your ideas into powerful, customized applications, we help you stay ahead of the curve in today’s competitive market.":"أطلق العنان لإمكانات أعمالك مع حلول برمجية متطورة مصممة لتعزيز النمو والابتكار. بتحويل أفكارك إلى تطبيقات قوية ومخصصة، نساعدك على البقاء في صدارة سوق اليوم التنافسي.",

    "company_intro":"<span>مقدمة</span> عن الشركة",
    "Najla Technologies – Your Trusted IT Partner in Riyadh":" نجلاء للتكنولوجيا و تقنية المعلومات – شريكك الموثوق في حلول تكنولوجيا المعلومات بالرياض",
    "Najla Technologies provides affordable, customized IT solutions for small and medium businesses (SMBs) in Riyadh. From app development to website design, we deliver innovative, culturally aligned solutions to help your business thrive. Discover how we can transform your digital presence today.":"تقدم نجلاء للتكنولوجيا وتقنية المعلومات حلول تكنولوجيا المعلومات المخصصة وبأسعار مناسبة للمؤسسات الصغيرة والمتوسطة في الرياض. من تطوير التطبيقات إلى تصميم المواقع، نقدم حلولاً مبتكرة تتماشى مع احتياجاتك الثقافية والتجارية. اكتشف كيف يمكننا تحويل تواجدك الرقمي اليوم.",

    "Empowering SMBs in the kingdom of Saudi Arabia with Tailored IT Solutions":"تمكين المؤسسات الصغيرة والمتوسطة في المملكة العربية السعودية بحلول تكنولوجيا المعلومات المخصصة",
    "At Najla Technologies, we understand the unique challenges faced by small and medium businesses (SMBs) in the kingdom. That’s why we specialize in delivering affordable, customized IT solutions that align with your business goals and cultural needs. Whether you need a custom app, a responsive website, or a digital transformation strategy, our team of Saudi and global experts is here to help you succeed in the digital age.":"في نجلاء للتكنولوجيا و تقنية المعلومات ، نتفهم التحديات الفريدة التي تواجهها المؤسسات الصغيرة والمتوسطة في المملكة. لهذا السبب نخصص جهودنا لتقديم حلول تكنولوجيا المعلومات المخصصة وبأسعار مناسبة والتي تتماشى مع أهداف عملك واحتياجاتك الثقافية. سواء كنت بحاجة إلى تطبيق متخصص، موقع إلكتروني متجاوب، أو استراتيجية تحول رقمي، فإن فريقنا من الخبراء السعوديين والدوليين هنا لمساعدتك على النجاح في العصر الرقمي.",


    "Our Journey From small Airbnb Rentals to Tailored Tech Solutions for Saudi Arabia":"قصتنا من التأجير اليومي إلى الحلول التقنية المصممة للسوق السعودي",
    "We began as a local company specializing in daily rental properties, and after proving our success in the real estate sector, we expanded by collaborating with international partners on technology projects. Through this journey, we realized that our deep understanding of Saudi culture and business needs makes us the perfect bridge between global innovation and local relevance. That’s why we partnered with leading international firms to deliver IT solutions specifically tailored for the Saudi market. What sets us apart from other IT agencies is:":"بدأنا كمؤسسة محلية متخصصة في تأجير العقارات اليومية، وبعد تحقيق نجاح كبير في هذا المجال، توسعنا من خلال التعاون مع شركاء دوليين في مشاريع تقنية. ومن خلال هذه التجربة، أدركنا أن فهمنا العميق للثقافة السعودية واحتياجات السوق يجعلنا الشريك المثالي لربط الابتكار العالمي بالخصوصية المحلية. ولهذا قررنا التعاون مع شركة عالمية رائدة لتقديم حلول تقنية مصممة خصيصًا لتناسب السوق السعودي. وما يميزنا عن أي وكالة تقنية أخرى هو:",
    "Personalized client care grounded in cultural understanding":"العناية الشخصية بالعملاء مبنية على فهم ثقافي عميق",
    "Local expertise with global standards":"خبرة محلية بمعايير عالمية",
    "Customized technology that fits the Saudi business environment":"حلول تقنية مخصصة لبيئة الأعمال السعودية",
    "Ongoing support that feels like a true partnership":"دعم مستمر يشعر العملاء بأننا شركاء حقيقيون",


    "Why Choose Najla Technologies?":"لماذا تختار نجلاء للتكنولوجيا و تقنية المعلومات ؟",
    "Cultural Understanding":"الفهم الثقافي",
    "As a Saudi-based IT firm, we deeply understand the local market, business practices, and customer preferences. Our solutions are designed to resonate with your audience and meet your specific needs.":"كمؤسسة سعودية متخصصة في تكنولوجيا المعلومات، نتفهم بعمق السوق المحلي والممارسات التجارية وما يفضله العملاء. حلولنا مصممة لتتناسب مع جمهورك وتلبي احتياجاتك الخاصة.",
    "Affordable and Flexible":"أسعار مناسبة ومرنة",
    "We offer competitive pricing and flexible payment plans to ensure our services fit your budget. Whether you’re an individual entrepreneur or a growing business, we have a solution for you.":"نقدم أسعاراً تنافسية وخطط دفع مرنة لضمان أن خدماتنا تناسب ميزانيتك. سواء كنت رائد أعمال فردي أو مؤسسة  نامية، لدينا الحل المناسب لك.",
    "Tailored Solutions":"حلول مخصصة",
    "From custom app development to website design, we create solutions that are tailored to your business. Our team works closely with you to ensure every detail meets your expectations.":"من تطوير التطبيقات المخصصة إلى تصميم المواقع الإلكترونية، نبتكر حلولاً مصممة خصيصاً لعملك. يعمل فريقنا عن كثب معك لضمان أن كل التفاصيل تلبي توقعاتك",
    "Expert Team":"فريق خبراء",
    "Our team combines Saudi cultural insights with global technical expertise to deliver high-quality, innovative solutions. We’re passionate about helping SMBs in Riyadh achieve their digital goals":"يجمع فريقنا بين الفهم الثقافي السعودي والخبرة التقنية العالمية لتقديم حلول عالية الجودة ومبتكرة. نحن متحفزون لمساعدة المؤسسات الصغيرة والمتوسطة في المملكة على تحقيق أهدافها الرقمية",

    "Our Services":"<span>خدمات</span>نا",
    "service-desc":"في <span>نجلاء للتكنولوجيا</span>، نقدم مجموعة شاملة من خدمات تكنولوجيا المعلومات المصممة لتلبية الاحتياجات الفريدة للمؤسسات الصغيرة والمتوسطة (SMBs) في الرياض. تشمل خبرتنا كل شيء من <span>تطوير المواقع الإلكترونية</span> إلى <span>الأمن السيبراني</span>، مما يضمن أن يظل عملك في الطليعة في العصر الرقمي.",
    "Web Development":"تطوير مواقع",
    "web-desc":"نقوم بإنشاء مواقع إلكترونية متجاوبة وسهلة الاستخدام ومصممة خصيصاً لاحتياجات عملك. سواء كنت بحاجة إلى <span>منصة تجارة إلكترونية</span>، <span>موقع شركة أو مؤسسة</span>، أو <span>تطبيق ويب مخصص</span>، فإن فريقنا يقدم حلولاً عالية الجودة تحقق النتائج المرجوة.",
    "Mobile Development":"تطوير تطبيقات الجوال",
    "mobile-desc":"من <span>نظام iOS</span> إلى <span>نظام Android</span>، نطور تطبيقات جوال سهلة الاستخدام وغنية بالميزات ومصممة لتنمو مع عملك. تم تصميم تطبيقاتنا لتعزيز تفاعل العملاء وتبسيط العمليات.",
    "UI/UX Design":"تصميم واجهة المستخدم وتجربة المستخدم",
    "First impressions matter. Our UI/UX design services ensure your website or app is visually appealing, easy to navigate, and optimized for user satisfaction.":"الانطباعات الأولى مهمة. تضمن خدمات تصميم واجهة المستخدم وتجربة المستخدم أن يكون موقعك أو تطبيقك جذاباً بصرياً، سهل التنقل، ومحسّناً لرضا المستخدم.",
    "IT Consultancy":"الاستشارات التكنولوجية",
    "Not sure where to start? Our IT consultancy services provide expert guidance to help you identify the right technology solutions for your business goals.":"لست متأكداً من أين تبدأ؟ توفر خدمات الاستشارات التكنولوجية لدينا إرشادات خبراء لمساعدتك في تحديد حلول التكنولوجيا المناسبة لأهداف عملك.",
    "QA & Testing":"ضمان الجودة والاختبار",
    "Quality is our priority. We conduct rigorous testing to ensure your website, app, or software is bug-free, secure, and performs flawlessly.":"الجودة هي أولويتنا. نقوم بإجراء اختبارات صارمة لضمان خلو موقعك أو تطبيقك أو برمجياتك من الأخطاء، وأنها آمنة وتعمل بسلاسة",
    "Cyber Security":"الأمن السيبراني",
    "cyber-desc":"احمِ عملك من التهديدات الرقمية مع حلولنا القوية للأمن السيبراني. من <span>تشفير البيانات</span> إلى <span>كشف التهديدات</span>، نحافظ على أمان معلوماتك الحساسة.",

    "workflow":"سير <span>العمل</span>",
    "workflow-desc":"في <span>نجلاء للتكنولوجيا وتقنية المعلومات</span>، نتبع سير عمل منظم وفعال لضمان تسليم مشروعك في الوقت المحدد، ضمن الميزانية، وبأعلى معايير الجودة. إليك كيف نعمل:",
    "Initial Consultation":"الاستشارة الأولية",
    "We start by understanding your business needs and project goals. Our team will schedule a meeting to discuss your requirements, budget, and timeline.":"نبدأ بفهم احتياجات عملك وأهداف مشروعك. سيقوم فريقنا بجدولة اجتماع لمناقشة متطلباتك، ميزانيتك، والجدول الزمني.",
    "Requirement Gathering":"جمع المتطلبات",
    "Our experts will work closely with you to gather all necessary details, including design preferences, technical specifications, and target audience.":"يعمل خبراؤنا عن كثب معك لجمع جميع التفاصيل اللازمة، بما في ذلك تفضيلات التصميم، المواصفات الفنية، والجمهور المستهدف.",
    "Proposal and Planning":"العرض التقديمي والتخطيط",
    "Based on your requirements, we’ll create a detailed project proposal, including timelines, milestones, and costs. Once approved, we move to the planning phase.":"بناءً على متطلباتك، سنقوم بإنشاء عرض تفصيلي للمشروع، يتضمن الجداول الزمنية، المعالم الرئيسية، والتكاليف. بمجرد الموافقة، ننتقل إلى مرحلة التخطيط.",
    "Design and Development":"التصميم والتطوير",
    "Our team will design and develop your project, whether it’s a website, mobile app, or custom software. We focus on user-friendly interfaces and seamless functionality.":"سيقوم فريقنا بتصميم وتطوير مشروعك، سواء كان موقعاً إلكترونياً، تطبيق جوال، أو برمجيات مخصصة. نركز على واجهات سهلة الاستخدام ووظائف سلسة.",
    "Testing and Quality Assurance":"الاختبار وضمان الجودة",
    "Before delivery, we rigorously test your project to ensure it’s bug-free, secure, and performs flawlessly across all devices and platforms.":"قبل التسليم، نقوم باختبار مشروعك بدقة لضمان خلوّه من الأخطاء، أمانه، وأدائه المثالي على جميع الأجهزة والمنصات.",
    "Deployment and Launch":"النشر والإطلاق",
    "Once testing is complete, we’ll deploy your project and ensure a smooth launch. Our team will provide training and support to help you get started.":"بعد الانتهاء من الاختبارات، سنقوم بنشر مشروعك وضمان إطلاقه بسلاسة. سيقدم فريقنا التدريب والدعم لمساعدتك على البدء.",
    "Post-Launch Support":"الدعم بعد الإطلاق",
    "We offer ongoing support and maintenance to ensure your project continues to perform at its best. Our team is always available to address any issues or updates.":"نقدم الدعم والصيانة المستمرة لضمان استمرار أداء مشروعك بأفضل شكل. فريقنا متاح دائماً لمعالجة أي مشكلات أو تحديثات.",

    "about_us":"<span>معلومات</span> عنا",
    "about_desc":"<span>نجلاء للتكنولوجيا وتقنية المعلومات</span> هي مؤسسة رائدة في مجال تكنولوجيا المعلومات مقرها الرياض، المملكة العربية السعودية. نشأت من نجاح <span>نجلاء رسيدنس</span>، المنشأة الشهيرة في تأجير الوحدات اليومية والمعروفة بضيافتها الاستثنائية، حيث نقدم نفس قيم <span>التميز، النزاهة، والابتكار</span> في عالم التكنولوجيا.",
    "our-team": "<span>فريق</span>نا",
    "team-desc":"فريقنا هو مزيج من <span>الخبرة الثقافية السعودية</span> و<span>المعرفة التقنية العالمية</span>. نحن متحمسون لمساعدة المؤسسات الصغيرة والمتوسطة في الرياض على تحقيق أهدافها الرقمية وملتزمون بتقديم التميز في كل مشروع.",
    "More Details":"مزيد من التفاصيل",

    "our_story":"<span>قصت</span>نا",
    "story_desc1":"بدأت رحلتنا برؤية بسيطة لكنها قوية: تمكين المؤسسات الصغيرة والمتوسطة من خلال <span>حلول تكنولوجيا المعلومات المخصصة وبأسعار مناسبة</span> التي تعزز النمو والنجاح. تماماً كما أعادت نجلاء رسيدنس تعريف الإقامة من خلال الجمع بين الضيافة العربية التقليدية والراحة الحديثة، نسعى إلى إحداث ثورة في مجال تكنولوجيا المعلومات في السعودية.",
    "story_desc2":"مستمدة من جذورنا، نحن ملتزمون بتقديم <span>حلول عالية الجودة ومخصصة</span> تلبي الاحتياجات الفريدة لعملائنا. سواء كنت رائد أعمال لديه فكرة جريئة أو مؤسسة قائمة تتطلع إلى النمو، نحن هنا لمساعدتك على الازدهار في العصر الرقمي.",
    
    "our_mission":"<span>مهمت</span>نا",
    "mission_desc":"مهمتنا هي تقديم <span>خدمات تكنولوجيا المعلومات المبتكرة والموثوقة وبأسعار مناسبة</span> التي تمكن المؤسسات الصغيرة والمتوسطة من المنافسة والنجاح في عالم اليوم الرقمي سريع الخطى. نركز على تقديم حلول ليست فقط متقدمة تقنياً، ولكنها أيضاً ذات صلة ثقافية وسهلة الاستخدام.",

    "We offer a comprehensive range of IT services, including:":"نقدم مجموعة شاملة من خدمات تكنولوجيا المعلومات، بما في ذلك:",    
    "Responsive, user-friendly websites tailored to your business needs.":"مواقع إلكترونية متجاوبة وسهلة الاستخدام مصممة خصيصاً لاحتياجات عملك.",
    "mobile":"تطبيقات مخصصة لنظام <span>أي أو إس</span> و<span>أندرويد</span> تعزز تفاعل العملاء.",
    "Visually appealing, easy-to-navigate designs optimized for user satisfaction.":"تصميمات جذابة بصرياً وسهلة التنقل محسّنة لرضا المستخدم.",
    "Expert guidance to help you identify the right technology solutions.":" استشارات من خبرائنا لمساعدتك في تحديد حلول التكنولوجيا المناسبة.",
    "Rigorous testing to ensure your project is bug-free and secure.":"اختبارات صارمة لضمان خلو مشروعك من الأخطاء وضمان أمانه.",
    "Robust solutions to protect your business from digital threats.":"حلول قوية لحماية عملك من التهديدات الرقمية.",

    "why_choose":"لماذا <span>تختار</span>نا؟",
    "As a Saudi-based company, we deeply understand the local market and business practices.":"كمؤسسة سعودية، نتفهم بعمق السوق المحلية والممارسات التجارية.",
    "Affordable and Transparent Pricing":"أسعار مناسبة وواضحة:",
    "We offer competitive pricing and flexible payment plans to fit your budget.":"نقدم أسعاراً تنافسية وخطط دفع مرنة لتناسب ميزانيتك.",
    "Every project is customized to meet your unique business needs.":"يتم تخصيص كل مشروع ليلبي احتياجات عملك الفريدة.",
    "Commitment to Quality":"الالتزام بالجودة:",
    "From rigorous testing to ongoing support, we ensure your project is delivered to the highest standards.":"من الاختبارات الصارمة إلى الدعم المستمر، نضمن تسليم مشروعك بأعلى المعايير.",
    "Local Expertise, Global Standards":"خبرة محلية، معايير عالمية:",
    "We combine Saudi cultural insights with global best practices to deliver world-class solutions.":"نجمع بين الفهم الثقافي السعودي وأفضل الممارسات العالمية لتقديم حلول عالية المستوى.",

    "We Believe In Making A Positive Change In The World":"نؤمن بصنع تغيير إيجابي في العالم",

    "Repla – Innovative and Adaptable Digital Solutions for Modern Business":"اكتشف أعمالنا المميزة في تطوير التطبيقات، تصميم المواقع، والتحول الرقمي لعمالئنا في الرياض والمملكة العربية السعودية",

    "Innovative technology solutions specifically designed to meet your business needs in Saudi Arabia and enhance your digital growth.":"حلول تقنية مبتكرة مصممة خصيصاً لتلبية احتياجات أعمالكم في السعودية وتعزيز نموكم الرقمي",

    "Our drawing is inside the portfolio he is holding in his arms.":"رسمنا موجود داخل الحقيبة التي يحملها بين ذراعيه.",

    "Our Projects":" ما نقدمه<span> للمشاريع</span>",
    "Get In Touch":"تواصل معنا",
    "Full Name":"الاسم الكامل",
    "Enter full name":"دخل الاسم الكامل",
    "Company Name (if applicable)":"اسم الشركة (إن وجد)",
    "Phone Number":"رقم الجوال",
    "Enter phone number":"أدخل رقم الجوال",
    "Email Address":"البريد الإلكتروني",
    "Enter email address":"أدخل الإيميل",

    "Project Details":"تفاصيل المشروع",
    "What type of service are you looking for?":"ما نوع الخدمة التي تبحث عنها؟",
    "Choose service":"اختر الخدمة",
    "Mobile App Development":"تطوير تطبيقات الجوال",
    "IT Consultation":"استشارات تقنية",
    "Technical Support":"دعم فني",
    "Other":"أخرى",
    "Please briefly describe your project or your needs.":"يرجى وصف مشروعك أو احتياجاتك بإيجاز.",
    "Enter briefly note":"أدخل ملاحظة مختصرة",
    "What is your target audience or market?":"ما هو جمهورك المستهدف أو السوق الذي تستهدفه؟",
    "Enter target audience or market":"أدخل الجمهور المستهدف أو السوق",
    "Do you have a specific deadline for this project?":"هل لديك موعد نهائي محدد لهذا المشروع؟",
    "Enter specific deadline":"أدخل الموعد النهائي المحدد",
    "Do you have an existing website, app, or system?":"هل لديك موقع إلكتروني أو تطبيق أو نظام حالي؟",
    "Yes":"نعم",
    "No":"لا",
    "Website Link":"رابط الموقع",
    "Enter website link":"أدخل رابط الموقع",

    "Technical and Design Preferences":"التفضيلات التقنية والتصميمية)",
    "Do you have design preferences (colors, style, references)?":"هل لديك تفضيلات تصميم (ألوان، أسلوب، أمثلة مرجعية)؟",
    "Enter design/style":"أدخل التصميم/النمط",
    "Are there any specific features you want to include?":"هل هناك ميزات محددة ترغب في إضافتها؟",
    "Enter specific features":"أدخل الميزات المحددة",
    "Do you require ongoing maintenance and support?":"هل تحتاج إلى صيانة ودعم مستمر؟",
    "Enter ongoing maintenance":"أدخل الصيانة المستمرة",
    
    "Budget and Contact":"الميزانية والتواصل",
    "What is your estimated budget for this project?":"ما هو الميزانية التقديرية لهذا المشروع؟",
    "Enter estimated budget":"أدخل الميزانية المتوقعة",
    "Preferred method of communication":"طريقة التواصل المفضلة",
    "Enter method communication":"أدخل طريقة التواصل",
    "Phone Call":"مكالمة هاتفية",
    "WhatsApp":"واتساب",
    "Email":"بريد إلكتروني",
    "In-person Meeting":"اجتماع حضوري",
    "Any additional notes or comments?":"هل لديك أي ملاحظات أو تعليقات إضافية؟",
    "Submit":"إرسال",

    "COMPANY":"شركة",
    "CONTACTS":"جهات الاتصال",
    "Inquires":"استفسارات",
    "Support":"دعم",
    "Repla Technologies All right reserved. © 2025":"جميع الحقوق محفوظة لشركة Repla Technologies. © 2025",

    "Empowering the Future: Arab Heritage Meets IT Innovation":"تمكين المستقبل: التقاليد العربية تلتقي بابتكارات تقنية المعلومات",
    "We strive to provide exceptional IT solutions that blend the rich traditions of Arab professionalism and ethics with cutting-edge technology. Our goal is to create an outstanding and seamless experience for every client by focusing on service excellence, integrity, and innovation.":"نسعى إلى تقديم حلول تقنية معلومات استثنائية تجمع بين تقاليد المهنية العربية العريقة وأحدث التقنيات. هدفنا هو تقديم تجربة متميزة وسلسة لكل عميل من خلال التركيز على التميز في الخدمة، والنزاهة، والابتكار",


    "Mohammed Usman":"محمد عثمان",
    "Co-Founder & IT Projects Director":"شريك مؤسس ومدير مشاريع تقنيةالمعلومات",
    "Najla alshail":"نجلاء الشعيل",
    "Founder & Managing Partner":"شريك مؤسس واداري",
    "Alyaa Alshail":"علياء الشعيل",
    "Operations and Client Relations Manager":"مديرة العمليات و العلاقات العامة",
    "Abdul Ahad Fatik":"عبدالعهد فاتيك",
    "Chief IT Engineer":"كبير مهندسي تقنية المعلومات",

    "Web Developer":"مبرمج",


    "Top-Notch Services":"خدمات عالية الجودة",
    "Our top-notch services are designed to exceed expectations and deliver exceptional results.":".نقدم خدمات تقنية عالية الجودة مصممة لتتجاوز التوقعات وتحقق نتائج استثنائية لعمالئنا",
    "Commitment to excellence":"التزام بالتميز",
    "We are dedicated to delivering exceptional services to clients around the globe.":".نلتزم بتقديم خدمات تقنية احترافية بمعايير عالمية لعمالئنا في المملكة العربية السعودية وحول العالم",
    "Customers Satisfaction":"رضا العمالء أولويتنا",
    "Above all, customer satisfaction is our top priority and we guarantee outstanding results. make this in to arabic and meet SEO requirements.":".نسعى دائ ًما لتحقيق رضا العمالء، ونضمن تقديم نتائج متميزة وخدمات تفوق التطلعات",


    "Our Proven Projects in Web, App, and IT Solutions Across Saudi Arabia":"مشاريعنا المتميزة في تطوير التطبيقات والمواقع وحلول تقنية المعلومات في السعودية",
    "Explore our portfolio of successful digital projects, including mobile app development, web platforms, and customized IT solutions delivered to businesses in Riyadh and throughout the Kingdom.":"استعرض أعمالنا الناجحة في تطوير تطبيقات الجوال، منصات الويب، وحلول تقنية المعلومات المصممة خصيصاً لعملائنا في الرياض وكافة أنحاء المملكة.",


    "read_what":"<span>شاهد آراء</span> عملائنا وتقييماتهم",
    "Don't take our word for it. Listen to our partners":"لا تعتمد فقط على كلامنا، استمع إلى شركائنا",

    "IT Project Management":"إدارة مشاريع التقنية",
    "UI Design":"تصميم واجهات الاستخدام",
    "Empowering Digital Success through Smart UI and Tailored Solutions":"بناء واجهات ذكية وحلول تقنية مبتكرة لنجاح أعمالكم",
    "In today’s competitive digital environment, user experience isn't just a feature—it’s the foundation. At Najla Technologies, we focus on delivering exceptional user interfaces (UI) that seamlessly connect users with powerful digital solutions. Our services are built to elevate your business and solve real-world challenges with precision.":"في عالمنا الرقمي المتسارع، لم تعد تجربة المستخدم مجرد خيار بل أصبحت حجر الأساس لأي مشروع ناجح. في نجلاء للتكنولوجيا و تقنية المعلومات، نركّز على تقديم واجهات استخدام مصممة بعناية وحلول تقنية مخصصة تدفع أعمالكم نحو التميز.",
    "1) Our Focus: Intuitive and Powerful UI Design":"١. تركيزنا الأساسي: تصميم واجهات استخدام ذكية وسهلة",
    "Our core strength lies in user interface design. We design UI that is modern, responsive, and tailored to your specific audience. Whether you're building a website, mobile application, or business platform, our team ensures that your users enjoy a smooth, accessible, and visually engaging experience.":"نتميّز في تصميم واجهات الاستخدام التي تتسم بالحداثة والسهولة والتجاوب مع جميع الأجهزة. سواء كنتم تطورون موقعًا إلكترونيًا أو تطبيقًا أو منصة تجارية، فإن فريقنا يضمن تجربة استخدام سلسة وجذابة ومريحة لعملائكم.",
    "What makes our UI services stand out:":"أهم ما يميز خدمات تصميم الواجهات لدينا:",
    "Tailored designs for each industry":"تصاميم مخصصة حسب طبيعة كل نشاط تجاري",
    "Responsive layouts for all devices":"تجاوب كامل مع جميع الأجهزة",
    "Clear call-to-action elements to drive engagement":"عناصر تفاعلية واضحة لجذب المستخدم",
    "Accessibility for all users, including those with disabilities":"مراعاة الشمولية لجميع فئات المستخدمين",
    "We don’t just design screens—we create user journeys that convert.":"نحن لا نصمّم شاشات فقط، بل نبني مسارات استخدام تؤدي إلى تحقيق النتائج.",
    "2) Common Challenges Our Clients Face":"٢. أبرز التحديات التي تواجه عملاءنا",
    "Many clients come to us after struggling with:":"كثير من عملائنا يواجهون مشاكل مثل:",
    "Outdated designs that confuse users and reduce conversions":"تصاميم قديمة تشتّت المستخدم وتقلل من المبيعات",
    "Poor mobile responsiveness and slow-loading interfaces":"عدم التوافق مع الأجهزة المحمولة وضعف سرعة التحميل",
    "Unclear navigation and lack of user engagement":"صعوبة التنقل داخل الموقع أو التطبيق",
    "Limited scalability and rigid systems":"أنظمة جامدة لا تقبل التوسّع أو التطوي",
    "These issues affect brand perception, retention rates, and overall profitability. We understand how frustrating it can be when technology doesn’t support your goals.":"تلك التحديات تؤثر على الصورة الذهنية للعلامة التجارية وتجربة العميل بشكل عام.",
    "3) Our Solutions: Strategy, Development, and Support":"٣. حلولنا: تخطيط، تطوير، ودعم مستمر",
    "We tackle digital problems with smart, practical solutions:":"نقدّم حلولًا ذكية وعملية تشمل:",
    "Full redesign of outdated user interfaces":"إعادة تصميم شاملة للواجهات القديمة",
    "Optimization for mobile, tablet, and desktop devices":"تحسين تجربة الاستخدام لجميع أنواع الأجهزة",
    "Strategic UX improvements to guide user actions and boost conversions":"تطوير استراتيجيات تفاعلية لرفع مستوى التفاعل والتحويل",
    "Custom dashboards, portals, and control panels":"بناء لوحات تحكم ومنصات إدارية مخصصة",
    "Ongoing support and updates based on your evolving needs":"دعم وتحديث مستمر حسب متطلبات المشروع",
    "At Najla Technologies, we combine innovation, strategy, and design to deliver results that speak for themselves. Let us help you build digital products that don’t just work—but thrive.":"في نجلاء للتكنولوجيا و تقنية المعلومات ، نمزج بين الابتكار والاستراتيجية والتصميم لنقدّم خدمات تتحدث عن نفسها. دعونا نساعدكم على بناء حلول رقمية لا تكتفي بالأداء، بل تتفوق.",


    "Data Backup & Recovery":"النسخ الاحتياطي واستعادة البيانات",
    "Website Design":"تصميم المواقع الإلكترونية",
    "Reliable Data Backup & Recovery Services to Secure Your Digital Assets":"خدمات النسخ الاحتياطي واستعادة البيانات لحماية أصولك الرقمية",
    "In a digital-first world, data is your most valuable asset. At Najla Technologies, we specialize in data backup and recovery services that protect your business from unexpected losses, cyber threats, and system failures. Our solutions ensure continuity, security, and peace of mind—no matter what challenges arise.":"في عصر التقنية، تُعتبر البيانات من أهم أصول أي مؤسسة. نحن في نجلاء للتكنولوجيا و تقنية المعلومات نقدّم خدمات النسخ الاحتياطي واستعادة البيانات التي تضمن حماية أعمالكم من المخاطر التقنية والاختراقات المفاجئة وتعطل الأنظمة، مما يضمن استمرارية أعمالكم وسلامة بياناتكم.",
    "1) Our Core Service: Intelligent Data Backup & Recovery":"١. خدمتنا الأساسية: نسخ احتياطي ذكي واستعادة بيانات فعالة",
    "We offer automated, secure, and scalable data backup and recovery solutions tailored for businesses of all sizes. Whether it's cloud-based, local storage, or hybrid backup systems, our approach ensures your information is always safe and recoverable when needed.":"نوفّر حلول نسخ احتياطي واستعادة بيانات مؤتمتة وآمنة وقابلة للتوسع، وتتناسب مع جميع أنواع المؤسسات. سواء كنتم تفضّلون التخزين السحابي أو المحلي أو حلول هجينة، فإن خدماتنا تضمن الحفاظ على بياناتكم وإمكانية استرجاعها في أي وقت.",
    "Key features of our data backup services:":"أبرز مميزات خدمات النسخ الاحتياطي لدينا:",
    "Regular automated backups":"نسخ احتياطي تلقائي ومنتظم",
    "Military-grade encryption for sensitive data":"تشفير قوي لحماية البيانات الحساسة",
    "Fast and seamless recovery processes":"عمليات استرجاع سريعة وسلسة",
    "Cloud and on-premise storage options":"خيارات تخزين محلي وسحابي",
    "Compliance with data protection regulations":"التوافق مع أنظمة حماية البيانات المعتمدة",
    "Your data deserves protection—our job is to guarantee it.":"نحن نؤمن أن حماية بياناتكم مسؤوليتنا.",
    "2) Challenges Our Clients Often Encounter":"٢. أبرز التحديات التي يواجهها عملاؤنا",
    "Many companies approach us after experiencing or fearing data-related problems such as:":"يلجأ إلينا الكثير من العملاء بعد تعرضهم أو خوفهم من مشاكل تتعلق بالبيانات، مثل:",
    "Accidental deletion or file corruption":"الحذف غير المقصود أو تلف الملفات",
    "Hardware failure or natural disasters":"تعطل الأجهزة أو الكوارث الطبيعية",
    "Ransomware attacks and unauthorized access":"الهجمات الإلكترونية مثل برامج الفدية",
    "Lack of secure backup systems":"غياب نظام نسخ احتياطي آمن",
    "Long downtime after data loss":"فترات توقف طويلة بعد فقدان البيانات",
    "These issues can halt operations, cost thousands, and damage trust. Prevention and preparation are essential.":"هذه المشكلات قد تؤدي إلى خسائر مالية كبيرة وتعطيل العمل.",
    "3) Our Solutions: Protection, Restoration, and Business Continuity":"٣. حلولنا: حماية واستعادة واستمرارية",
    "We solve these challenges by offering complete and proactive solutions:":"نوفّر حلولًا شاملة واستباقية تشمل:",
    "Real-time backup scheduling and alerts":"جداول نسخ احتياطي في الوقت الفعلي وتنبيهات فورية",
    "Secure disaster recovery plans":"خطط استجابة للكوارث واستعادة آمنة",
    "Full data restoration within hours":"استرجاع كامل للبيانات خلال ساعات",
    "Continuous monitoring and updates":"مراقبة مستمرة وتحديثات دورية",
    "Multi-location storage redundancy":"تخزين البيانات في أكثر من موقع لحمايتها من الطوارئ",
    "With Najla Technologies, you’ll never worry about losing your data. We give you the tools and support to stay protected and keep moving forward with confidence.":"مع نجلاء للتكنولوجيا و تقنية المعلومات ، لا داعي للقلق بشأن فقدان البيانات. نقدّم لكم الأدوات والدعم اللازم لضمان الحماية التامة واستمرار العمل بثقة.",


    "Paid Media Solution":"حلول الإعلانات الممولة",
    "Business Consulting":"الاستشارات التجارية",
    "Maximize Your Reach with Strategic Paid Media Solutions":"حلول الإعلانات المدفوعة لزيادة الانتشار وتحقيق نتائج ملموسة",
    "In today’s competitive market, organic reach alone isn’t enough. At Najla Technologies, we empower businesses to grow faster and smarter through customized paid media solutions. From social ads to search engine campaigns, our data-driven strategies ensure every dollar spent delivers measurable impact.":"في عالم تسوده المنافسة، لا تكفي الطرق التقليدية لتحقيق النمو المطلوب. في نجلاء للتكنولوجيا و تقنية المعلومات ، نقدّم حلولًا احترافية في مجال الإعلانات المدفوعة تساعدكم على الوصول إلى جمهوركم المستهدف وتحقيق عائد واضح من كل ريال يتم إنفاقه.",
    "1) Our Core Service: Targeted Paid Media Campaigns":"١. خدمتنا الأساسية: حملات إعلانية موجهة باحترافية",
    "We build strategic advertising campaigns that connect you with the right audience at the right time. Our paid media experts create, manage, and optimize ads across platforms like Google, YouTube, Instagram, TikTok, and others, focusing on conversions—not just clicks.":"نقوم ببناء حملات إعلانية ذكية تستهدف الجمهور المناسب في الوقت المناسب. يتولى فريقنا المتخصص إدارة الحملات على المنصات مثل محركات البحث، يوتيوب، إنستغرام، وتطبيقات الفيديو، مع التركيز على التحويلات وليس فقط النقرات.",
    "Our paid media services include:":"خدمات الإعلانات المدفوعة لدينا تشمل:",
    "Audience research and segmentation":"دراسة وتحليل الجمهور المستهدف",
    "Campaign planning and budget optimization":"تخطيط الحملات وتحديد الميزانية المناسبة",
    "A/B testing for high performance":"اختبار الأداء للوصول إلى أعلى نتائج",
    "Keyword targeting and retargeting strategies":"استهداف دقيق للكلمات المفتاحية وإعادة الاستهداف",
    "Monthly performance reporting and ROI tracking":"تقارير أداء شهرية وقياس العائد على الاستثمار",
    "Every ad we run is designed to deliver results that align with your business goals.":"نحن لا ننشر إعلانات فقط، بل نبني استراتيجيات تُحقق نتائج واضحة.",
    "2) Common Pain Points Businesses Face":"٢. المشاكل الشائعة التي تواجهها الشركات",
    "Many businesses struggle with:":"من أبرز المشاكل التي يواجهها عملاؤنا:",
    "Spending on ads without clear results":"صرف مبالغ كبيرة على الإعلانات دون نتائج ملموسة",
    "Poor targeting and low return on investment":"استهداف غير دقيق يؤدي إلى ضعف الأداء",
    "Difficulty managing campaigns across multiple platforms":"صعوبة إدارة الحملات على عدة منصات في آن واحد",
    "Lack of expertise in ad design and copy":"ضعف جودة التصاميم الإعلانية والمحتوى التسويقي",
    "Not knowing how to scale winning campaigns":"عدم وجود خطة لتوسيع الحملات الناجحة",
    "Paid media can drain budgets if not managed correctly. That’s where we step in.":"الإعلانات المدفوعة يمكن أن تصبح عبئًا ماليًا إذا لم تُدار بشكل احترافي.",
    "3) Our Solutions: Strategic Growth Through Data and Creativity":"٣. حلولنا: نمو استراتيجي يجمع بين البيانات والإبداع",
    "We address these issues with a full-service solution:":"نقدّم حلولًا شاملة للتعامل مع هذه التحديات:",
    "Data-driven strategy built on your business goals":"استراتيجيات مبنية على أهداف نشاطكم التجاري",
    "Creative and compelling ad copy and visuals":"محتوى إبداعي بصري ونصي يجذب الجمهور",
    "Cross-platform campaign management":"إدارة حملات على مختلف المنصات",
    "Real-time monitoring and weekly optimization":"مراقبة وتحسين مستمر للأداء",
    "Transparent reporting and improvement plans":"تقارير شفافة وخطط تطوير دورية",
    "With Najla Technologies, your ad spend becomes an investment, not an expense. We help you grow your visibility, traffic, and revenue—all while keeping your brand top of mind.":"مع نجلاء للتكنولوجيا و تقنية المعلومات ، يصبح الإنفاق على الإعلانات استثمارًا حقيقيًا. نساعدكم على تعزيز الظهور، زيادة الزوار، وتحقيق نمو ملموس في الأرباح.",


    "Advanced Cyber Security Services to Protect Your Business":"خدمات الأمن السيبراني لحماية بياناتكم وأنظمتكم الرقمية",
    "In an era of rising digital threats, cyber security is no longer optional—it’s essential. At Najla Technologies, we provide robust cyber security solutions designed to defend your systems, data, and reputation against breaches, malware, and evolving cyber risks.":"في ظل تصاعد التهديدات الرقمية، أصبح الأمن السيبراني ضرورة لا غنى عنها. في شركة نجلاء للتكنولوجيا وتقنية المعلومات ، نقدّم حلولًا متكاملة لحماية بياناتكم، أنظمتكم، وسمعتكم من الاختراقات والبرمجيات الخبيثة والتهديدات المستمرة.",
    "1) Our Core Service: Proactive Cyber Security Solutions":"١. خدمتنا الأساسية: حلول وقائية لحماية الأمن السيبراني",
    "Our cyber security services are tailored to anticipate and neutralize threats before they cause damage. Whether you’re a startup, enterprise, or government entity, we deliver comprehensive protection through monitoring, threat detection, and risk management.":"نوفّر خدمات أمن سيبراني مصممة للتعامل الاستباقي مع التهديدات الرقمية. سواء كانت مؤسستكم صغيرة أو كبيرة أو حكومية، فإننا نؤمّن لكم الحماية من خلال أنظمة متطورة للرصد والتحليل وإدارة المخاطر.",
    "What we offer:":"خدماتنا تشمل:",
    "Network and endpoint protection":"حماية الشبكات والأجهزة",
    "Firewall configuration and intrusion prevention":"إعداد أنظمة الحماية ومنع التسلل",
    "Threat intelligence and vulnerability assessments":"تحليل التهديدات وتقييم نقاط الضعف",
    "Secure access controls and encryption":"إدارة الوصول وتشفير البيانات",
    "24/7 monitoring and real-time alerts":"مراقبة مستمرة وتنبيهات فورية على مدار الساعة",
    "We build digital environments where your business and customers stay secure at all times.":"نصنع بيئة رقمية آمنة تُمكّنكم من العمل بثقة.",
    "2) Common Security Challenges Businesses Face":"٢. أبرز التحديات الأمنية التي يواجهها العملاء",
    "Many organizations approach us after experiencing—or fearing—cyber threats such as:":"يلجأ إلينا الكثير من العملاء بعد تعرّضهم أو خوفهم من تهديدات مثل:",
    "Ransomware attacks":"هجمات برمجيات الفدية",
    "Data breaches or leaks":"تسريب أو اختراق البيانات الحساسة",
    "Weak passwords and unauthorized access":"ضعف كلمات المرور والدخول غير المصرح به",
    "Phishing attempts and email scams":"محاولات احتيال عبر البريد الإلكتروني",
    "Lack of internal security policies or outdated systems":"غياب سياسات أمنية داخلية أو أنظمة قديمة",
    "Cyber threats evolve quickly, and a reactive approach is no longer sufficient.":"التهديدات تتطور بسرعة، والحلول التقليدية لم تعد كافية.",
    "3) Our Solutions: Protection, Compliance, and Peace of Mind":"٣. حلولنا: حماية شاملة وامتثال وطمأنينة",
    "Najla Technologies offers layered protection and peace of mind through:":"نقدّم في نجلاء للتكنولوجيا و تقنية المعلومات حماية متعددة المستويات تشمل:",
    "Security audits and risk assessments":"تدقيق أمني شامل وتقييم للمخاطر",
    "Employee training to prevent social engineering attacks":"تدريب الموظفين للحد من الهجمات الاحتيالية",
    "Regular software updates and patch management":"تحديثات دورية وإدارة الثغرات البرمجية",
    "Incident response and recovery plans":"خطط للاستجابة السريعة واستعادة البيانات",
    "Compliance with local and international data protection standards":"الالتزام بأنظمة حماية البيانات المحلية والعالمية",
    "With our support, you’ll stay ahead of threats, maintain customer trust, and ensure operational continuity in a connected world.":"مع خدماتنا، تحافظون على أمان أعمالكم وثقة عملائكم، وتواصلون العمل دون انقطاع في عالم متصل دائمًا.",


    "Banking Landing Page Design":"تصميم صفحة وصول للخدمات المصرفية",
    "High-Converting Banking Landing Page Design for Modern Financial Institutions":"تصميم صفحات وصول للبنوك تحقق الثقة وتزيد من التحويلات",
    "In today’s digital banking environment, your landing page is more than a first impression—it’s your frontline for building trust, driving engagement, and generating leads. At Najla Technologies, we create powerful, secure, and conversion-optimized banking landing page designs tailored for financial institutions.":"في القطاع المالي، تُعد الثقة والوضوح والأمان من العوامل الأساسية لنجاح أي جهة مصرفية. نحن في نجلاء للتكنولوجيا و تقنية المعلومات نُقدّم تصاميم صفحات هبوط مخصصة للبنوك تجمع بين الاحترافية والفعالية، لتُظهر خدماتكم بشكل يجذب العملاء ويزيد من التفاعل.",
    "1) Our Core Service: Strategic Banking Landing Page Design":"١. خدمتنا الأساسية: تصميم صفحات هبوط فعالة للمجال المصرفي",
    "We design custom banking landing pages that balance trust, performance, and design. Our team ensures every detail—from layout to load speed—is tailored to drive action, improve lead generation, and maintain full compliance with industry regulations.":"نقوم بتصميم صفحات هبوط خاصة بالبنوك، وشركات التقنية المالية، والمؤسسات المالية. يتم التركيز على تصميم احترافي يعكس قوة العلامة التجارية ويُحفّز الزوار لاتخاذ الإجراء المطلوب سواء كان فتح حساب، أو تقديم على قرض، أو استخدام الخدمات الرقمية.",
    "Features of our banking landing page design service:":"أبرز مميزات صفحات الهبوط التي نقدّمها:",
    "Clean, professional, and mobile-responsive design":"تصميم احترافي وآمن يعكس هوية البنك",
    "Built-in security features for financial data protection":"أزرار دعوة واضحة وسهلة الوصول",
    "Clear calls-to-action for account sign-ups and inquiries":"تصميم متجاوب مع جميع الأجهزة",
    "Fast loading speed and SEO-friendly structure":"الالتزام بمعايير تجربة المستخدم في المجال المالي",
    "Integration with banking CRM or internal systems":"إبراز عناصر الثقة مثل الشهادات وآراء العملاء وأمان الاتصال",
    "Our goal is to create a page that converts traffic into clients—safely and effectively.":"كل عنصر في الصفحة يخدم هدفك في كسب ثقة العميل وتحقيق نتائج.",
    "2) Key Challenges in Financial Page Design":"٢. أبرز التحديات التي تواجهها المؤسسات المالية",
    "Financial institutions often face:":"كثير من البنوك تواجه صعوبات مثل:",
    "Low trust and poor conversion from generic landing pages":"صفحات هبوط قديمة أو غير متجاوبة",
    "Lack of responsiveness across mobile and tablet devices":"إنفاق كبير على الإعلانات دون تحقيق تحويلات",
    "Inconsistent branding and outdated visuals":"رسائل تسويقية غير واضحة أو غير مؤثرة",
    "Difficult navigation and lack of clear calls-to-action":"ضعف ترتيب العناصر وعدم ملاءمة الاستخدام عبر الهاتف",
    "Security concerns regarding sensitive customer information":"غياب عناصر الثقة والأمان في التصميم",
    "These issues impact credibility, user experience, and digital success.":"في عالم المال، الصفحة الضعيفة تعني فقدان الثقة والعميل.",
    "3) Our Solutions: Secure Design with High Engagement":"٣. حلولنا: تصميم استراتيجي يعزز الثقة ويزيد النتائج",
    "Najla Technologies provides end-to-end banking page solutions:":"نقدّم في نجلاء للتكنولوجيا و تقنية المعلومات حلولًا شاملة تتضمن:",
    "User-centric layouts that encourage trust and action":"إعداد هيكل تخطيطي واستراتيجي للصفحة",
    "Full responsiveness on all devices":"تصميم سريع الاستجابة ومحسّن للأداء",
    "Strong visual branding that reflects your identity":"تكامل سلس مع أنظمة إدارة العملاء والنماذج الذكية",
    "Optimized user flow for better lead capture":"إبراز الهوية البصرية والعناصر التي تعزز الثقة",
    "Implementation of SSL, encryption, and compliance tools":"اختبار وتحسين مستمر لزيادة معدلات التحويل",
    "With our expertise, you get a banking landing page that performs just as well as it looks—while keeping every click secure.":"نساعدكم على بناء انطباع رقمي أول يعزز الثقة ويحول الزائر إلى عميل دائم في بيئة مالية متطورة.",



    "Task Management App":"تطبيقات إدارة المهام",
    "Mobile App":"تطبيقات الجوال",
    "Custom Mobile App Development That Turns Ideas into Scalable Solutions":"تطوير تطبيقات الجوال المصممة خصيصًا لنجاح أعمالكم",
    "In today’s mobile-first world, a powerful app can define your success. At Najla Technologies, we design and develop high-performing mobile applications tailored to your goals, whether you're launching a startup or digitizing an enterprise.":"في عالم تهيمن عليه الأجهزة المحمولة، أصبح امتلاك تطبيق فعّال ضرورة للنجاح. نحن في نجلاء للتكنولوجيا و تقنية المعلومات نقدّم خدمات تطوير تطبيقات جوال متكاملة، مصممة خصيصًا لتلائم أهدافكم وتحقق النمو المستدام.",
    "1) Our Core Service: Full-Cycle Mobile App Development":"١. خدمتنا الأساسية: تطوير تطبيقات جوال متكاملة",
    "We provide end-to-end mobile app development for iOS and Android platforms. From strategy and UX/UI design to coding, testing, and deployment—we cover every step. Our apps are scalable, secure, and optimized for performance across all devices.":"نقدّم خدمات تطوير تطبيقات الجوال على جميع الأنظمة، تشمل التخطيط، التصميم، البرمجة، الاختبار، والنشر. نعمل على بناء تطبيقات عالية الأداء، آمنة وسهلة الاستخدام وتعمل بسلاسة على مختلف الأجهزة.",
    "Our mobile app services include:":"تشمل خدماتنا:",
    "Native and cross-platform development":"تطوير تطبيقات أصلية وتطبيقات متعددة الأنظمة",
    "User interface and experience design":"تصميم واجهات استخدام وتجربة مستخدم جذابة",
    "Backend integration and database setup":"ربط قواعد البيانات وأنظمة التحكم الخلفية",
    "Secure login and user authentication":"أنظمة تسجيل دخول آمنة ومصادقة المستخدم",
    "App Store and Google Play deployment":"رفع التطبيق على متاجر التطبيقات وتحديثاته",
    "Whether it's a booking system, e-commerce, or internal tool, we turn your idea into an intuitive app.":"سواء كان التطبيق لخدمة العملاء أو إدارة العمليات أو البيع، نحن نحقق فكرتك بطريقة عملية وذكية.",
    "2) Common Problems Clients Face":"٢. أبرز التحديات التي تواجه العملاء",
    "Businesses often struggle with:":"يعاني الكثير من العملاء من:",
    "Inconsistent app performance or frequent crashes":"بطء التطبيق أو الأعطال المتكررة",
    "Outdated designs and poor user experience":"تصميم قديم وتجربة مستخدم ضعيفة",
    "Lack of scalability and difficult maintenance":"عدم قدرة التطبيق على التوسع أو صعوبة صيانته",
    "Delayed delivery or unstructured development cycles":"تأخير في التسليم أو غياب خطة تطوير واضحة",
    "Low app store visibility and poor user engagement":"ضعف ظهور التطبيق في المتاجر وقلة التفاعل",
    "These problems hurt brand image, waste budgets, and stall growth.":"هذه المشاكل تُؤثر على سمعة العلامة التجارية وتُعيق النجاح.",
    "3) Our Solutions: Agile, Scalable, and Market-Ready":"٣. حلولنا: تطوير مرن وقابل للتوسع وجاهز للسوق",
    "We solve these issues with modern, agile development methods:":"نحن نعالج هذه المشكلات من خلال منهجيات تطوير حديثة تشمل:",
    "Structured planning and prototype validation":"تخطيط دقيق ونماذج أولية واضحة",
    "Clean, maintainable code and modular structure":"برمجة نظيفة وهيكل مرن يسهل التحديث",
    "Performance optimization for all devices":"تحسين الأداء لجميع الأجهزة",
    "Ongoing testing, updates, and feature rollouts":"تحديثات دورية واختبارات مستمرة",
    "Marketing support for launch and visibility":"دعم تسويقي لظهور التطبيق وانتشاره",
    "At Najla Technologies, your mobile app is not just a product—it’s a smart solution built to grow with you.":"في نجلاء للتكنولوجيا و تقنية المعلومات ، لا نكتفي بتسليم تطبيق، بل نبتكر لكم حلاً ذكيًا يساعد على نمو أعمالكم بثبات."
}